from config import OWNER_USERNAME, SUPPORT_GRP
from RISHUCHATBOT import RISHUCHATBOT
from pyrogram import Client, filters



START = """**
┌────── ˹ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ˼──────•
┆◍ ʜᴇʏ ᴛʜᴇʀᴇ!
└──────────────────────•
» ✦ ᴛʜᴇ ꜱᴜᴘᴇʀꜰᴀꜱᴛ ᴄʜᴀᴛʙᴏᴛ
» ✦ ꜱᴜᴘᴘᴏʀᴛꜱ ᴛᴇxᴛ, ꜱᴛɪᴄᴋᴇʀ, ᴘʜᴏᴛᴏ, ᴠɪᴅᴇᴏ
» ✦ ᴍᴜʟᴛɪ-ʟᴀɴɢᴜᴀɢᴇ ғᴏʀ ᴇᴀᴄʜ ᴄʜᴀᴛ
» ✦ ᴄʜᴀᴛʙᴏᴛ ᴇɴᴀʙʟᴇ/ᴅɪꜱᴀʙʟᴇ ʏᴏᴜʀ ᴡᴀʏ
» ✦ ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ɪᴅ-ᴄʜᴀᴛʙᴏᴛ
•──────────────────────•
❖ ᴘᴏᴡᴇʀᴇᴅ ʙʏ ➛ [ʀɪsʜυ ʙσᴛ ](t.me/rishu1286)
•──────────────────────•

**"""

HELP_READ = f"""**
```❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ
ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ
ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /```**
"""

TOOLS_DATA_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ᴛᴏᴏʟꜱ:

➻ /start ᴛᴏ ᴡᴀᴋᴇ ᴜᴘ ᴛʜᴇ ʙᴏᴛ ᴀɴᴅ ʀᴇᴄᴇɪᴠᴇ ᴀ ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ!
──────────────
➻ /help ғᴏʀ ɢᴇᴛᴛɪɴɢ ᴅᴇᴛᴀɪʟs ᴀʙᴏᴜᴛ ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ғᴇᴀᴛᴜʀᴇs.
──────────────
➻ /ping ᴛᴏ ᴄʜᴇᴄᴋ ᴛʜᴇ ʀᴇsᴘᴏɴsᴇ ᴛɪᴍᴇ (ᴘɪɴɢ) ᴏғ ᴛʜᴇ ʙᴏᴛ!
──────────────
➻ /id ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴜsᴇʀ ɪᴅ, ᴄʜᴀᴛ ɪᴅ, ᴀɴᴅ ᴍᴇssᴀɢᴇ ɪᴅ ᴀʟʟ ɪɴ ᴏɴᴇ ᴍᴇssᴀɢᴇ.
──────────────
➻ /broadcast ᴛᴏ ғᴏʀᴡᴀʀᴅ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs ʙᴀsᴇᴅ ᴏɴ sᴘᴇᴄɪғɪᴇᴅ ғʟᴀɢs!\nᴇxᴀᴍᴘʟᴇ: `/broadcast -user -pin ʜᴇʟʟᴏ ғʀɪᴇɴᴅs`
──────────────
➻ /shayri ɢᴇᴛ ʀᴀɴᴅᴏᴍ sʜᴀʏʀɪ ғᴏʀ ʏᴏᴜʀ ʟᴏᴠᴇ
──────────────
 **
"""

CHATBOT_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ᴄʜᴀᴛʙᴏᴛ:

➻ /chatbot - ᴏᴘᴇɴs ᴏᴘᴛɪᴏns ᴛᴏ ᴇɴᴀʙʟᴇ ᴏʀ ᴅɪsᴀʙʟᴇ ᴛʜᴇ ᴄʜᴀᴛʙᴏᴛ.
──────────────
➻ /lang, /language, /setlang - ᴏᴘᴇɴs ᴀ ᴍᴇɴᴜ ᴛᴏ sᴇʟᴇᴄᴛ ᴛʜᴇ ᴄʜᴀᴛ ʟᴀɴɢᴜᴀɢᴇ.  
──────────────
➻ /resetlang, /nolang - ʀᴇsᴇᴛs ᴛʜᴇ ʙᴏᴛ's ʟᴀɴɢᴜᴀɢᴇ ᴛᴏ ᴍɪxᴇᴅ ʟᴀɴɢᴜᴀɢᴇ.
──────────────
➻ /chatlang - ɢᴇᴛ ᴄᴜʀʀᴇɴᴛ ᴜꜱɪɴɢ ᴄʜᴀᴛ ʟᴀɴɢ ꜰᴏʀ ᴄʜᴀᴛ.
──────────────
➻ /status - ᴄʜᴇᴄᴋ ᴄʜᴀᴛʙᴏᴛ ᴀᴄᴛɪᴠᴇ ᴏʀ ɴᴏᴛ.
──────────────
➻ /stats - ɢᴇᴛ ʙᴏᴛ ꜱᴛᴀᴛꜱ
──────────────


**
"""

SOURCE_READ = f"**❍ ʜᴇʏ, ᴛʜᴇ [{RISHUCHATBOT.name}](https://t.me/{RISHUCHATBOT.username}) ɪs ɴᴇᴡ ᴘᴏᴡᴇʀғᴜʟʟ ᴄʜᴀᴛʙᴏᴛ ᴏғ ᴡʜᴏʟᴇ ᴛᴇʟᴇɢʀᴀᴍ.**\n\n**❍ ᴘʟᴇᴀsᴇ ᴅᴏɴᴀᴛᴇ ᴛʜᴇ ᴅᴇᴠʟᴏᴘᴇʀ ᴛᴏ ᴍᴀɪɴᴛᴀɪɴ ᴛʜᴇ ᴘʀᴏɪᴇᴄᴛs**\n\n**⦿──────────────────⦿**\n\n**❍ ʜᴇʀᴇ ɪs ᴛʜᴇ ǫʀ [ᴅᴏɴᴀᴛᴇ ʜᴇʀᴇ](https://t.me/RishuQR/8)**\n\n**⦿──────────────────⦿**\n\n**❍ɪғ ʏᴏᴜ ғᴀᴄᴇ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ᴛʜᴇɴ ᴄᴏɴᴛᴀᴄᴛ ᴀᴛ [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ](https://t.me/{SUPPORT_GRP})..\n\n<b>||❍ ʟᴏᴠᴇ ᴡɪᴛʜ ➪ [↬꯭ᬃ꯭ ⃪꯭ ꯭⁢⁣⁤⁣⁣⁢⁣⁤⁢⁤⁣⁢⁤⁣⁤᪳᪳🇷꯭𝚰𝛅꯭꯭ʜ꯭֟፝፝֟ᴜ ꯭꯭༗꯭»꯭݅݅݅݅𓆪](https://t.me/ur_rishu_143) **||</b>"

ADMIN_READ = f"""**
๏ ʜᴇʀᴇ ᴀʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅs ғᴏʀ ᴄʟᴏɴᴇ ᴄʜᴀᴛʙᴏᴛ:

──────────────
➻ /clone [ ʙᴏᴛ ᴛᴏᴋᴇɴ ] - ᴛᴏ ᴄʟᴏɴᴇ ʏᴏᴜʀ ʙᴏᴛ.
──────────────
➻ /idclone [ ᴩʏʀᴏɢʀᴀᴍ ꜱᴛʀɪɴɢ ꜱᴇꜱꜱɪᴏɴ ] - ᴛᴏ ᴍᴀᴋᴇ ɪᴅ-ᴄʜᴀᴛʙᴏᴛ.
──────────────
➻ /delclone [ ʙᴏᴛ ᴛᴏᴋᴇɴ ] - ᴛᴏ ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ ᴄʟᴏɴᴇ ʙᴏᴛ.
──────────────
➻ /delidclone [ ᴩʏʀᴏɢʀᴀᴍ ꜱᴛʀɪɴɢ ꜱᴇꜱꜱɪᴏɴ ] - ᴛᴏ  ᴅᴇʟᴇᴛᴇ ʏᴏᴜʀ ɪᴅ-ᴄʜᴀᴛʙᴏᴛ.
──────────────

**"""

ABOUT_READ = f"""
**───────────────────────
❖ ɪ ʜᴧᴠє ϻσsᴛ ᴘσᴡєʀғυʟʟ υsєғυʟ ɢʀσυᴘ
    ᴄʜᴀᴛʙᴏᴛ + ᴄʟᴏɴᴇʀ ʙσᴛ ғєᴧᴛυʀєs
───────────────────────
● ᴡʀɪᴛᴛєη ɪη ᴩʏᴛʜση ᴡɪᴛʜ sǫʟᴧʟᴄʜєϻʏ
   ᴧηᴅ ϻσηɢσᴅʙ ᴧs ᴅᴧᴛᴧʙᴧsє
───────────────────────
● ɪ ᴄᴧη ʀєꜱᴛʀɪᴄᴛ υꜱєʀꜱ
● ɪ ʜᴧᴠє ᴧη ᴧᴅᴠᴧηᴄєᴅ ᴧηᴛɪ-ꜰʟσσᴅ ꜱʏꜱᴛєϻ
● ᴧᴅᴠᴧηᴄє ϻᴧηᴧɢєϻєηᴛ ᴄᴧᴘᴧʙɪʟɪᴛʏ
● ᴧηɪϻє ʙσᴛ ғυηᴄᴛɪσηᴧʟɪᴛʏ
● ᴧɪ ɪηᴛєɢʀᴧᴛɪση
───────────────────────
❖ υᴘᴅᴧᴛєs ᴄʜᴧηηєʟ ➥ [ʀɪsʜυ υᴘᴅᴧᴛє](https://t.me/ur_rishu_143)
❖ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ➥ [ʀɪsʜυ sυᴘᴘσʀᴛ](https://t.me/ur_support07)
❖ ʀєᴧʟ σᴡηєʀ ➥ [ʀɪsʜυ sᴧηᴧᴛᴧηɪ](https://t.me/Rishu1286)
❖ ʀєᴘσ ➥ [ ʀєᴘσ ](https://github.com/RishuBot/RishuChatBot)
───────────────────────
❖ ᴄʟɪᴄᴋ ση ᴛʜє ʜєʟᴩ ʙυᴛᴛση ᴛσ ɢєᴛ ɪηғσ
    ᴧʙσυᴛ ϻʏ ϻσᴅυʟєs ᴧηᴅ ᴄσϻϻᴧηᴅs...!
───────────────────────**
"""



RGAM = f"""
**⌯ ᴘʟᴧʏ ɢᴧϻє ⌯

❖ /dice ─ ᴅɪᴄє  
❖ /dart ─ ᴅᴧʀᴛ  
❖ /basket ─ ʙᴧsᴋєᴛ ʙᴧʟʟ  
❖ /ball ─ ʙσᴡʟɪηɢ ʙᴧʟʟ  
❖ /football ─ ғσσᴛʙᴧʟʟ  
❖ /jackpot ─ sᴘɪη sʟσᴛ ϻᴧᴄʜɪηє


```⌯ ᴛᴧɢ ᴧʟʟ ⌯```

❖ /tagall ─ ᴛᴧɢ ᴧʟʟ ϻєϻʙєʀs  
  
```⌯ ϻєϻє ғυη ⌯```

❖ /meme ─ sєηᴅ ʀᴧηᴅσϻ ϻєϻє  
**
"""